{
  "format": "layers-model",
  "generatedBy": "export_model_tfjs.py",
  "convertedBy": "manual",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense",
          "inbound_nodes": []
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.3,
            "seed": null,
            "noise_shape": null
          },
          "name": "dropout",
          "inbound_nodes": []
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_1",
          "inbound_nodes": []
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.2,
            "seed": null,
            "noise_shape": null
          },
          "name": "dropout_1",
          "inbound_nodes": []
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 29,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_2",
          "inbound_nodes": []
        }
      ]
    },
    "keras_version": "2.x",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            63,
            128
          ],
          "dtype": "float32",
          "byteOffset": 0,
          "byteLength": 32256
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32",
          "byteOffset": 32256,
          "byteLength": 512
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32",
          "byteOffset": 32768,
          "byteLength": 32768
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "byteOffset": 65536,
          "byteLength": 256
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            29
          ],
          "dtype": "float32",
          "byteOffset": 65792,
          "byteLength": 7424
        },
        {
          "name": "dense_2/bias",
          "shape": [
            29
          ],
          "dtype": "float32",
          "byteOffset": 73216,
          "byteLength": 116
        }
      ]
    }
  ],
  "userDefinedMetadata": {
    "classes": [
      "A",
      "B",
      "C",
      "D",
      "E",
      "F",
      "G",
      "H",
      "I",
      "J",
      "K",
      "L",
      "M",
      "N",
      "O",
      "P",
      "Q",
      "R",
      "S",
      "T",
      "U",
      "V",
      "W",
      "X",
      "Y",
      "Z",
      "del",
      "nothing",
      "space"
    ]
  }
}